JayHeng/cortex-m-apps/devices_v3/MIMXRT798S/drivers/fsl_irtc.c
    /*
     * Tamper queue does not store the year field as this value can be read from RTC_YEARMON.
     * It is expected that the queue will be read at least once in a year.
     */
    tamperTimestamp->year = 0;
    /* From the first read; TAMPER_DATA[4:0] is the hour field */
    tamperTimestamp->hour = (uint8_t)temp1 & 0x1FU;
    /* From the first read; TAMPER_DATA[9:5] is the day field */
    tamperTimestamp->day = (uint8_t)(temp1 >> 5U) & 0x1FU;
    /* From the first read; TAMPER_DATA[13:10] is the month field */
    tamperTimestamp->month = (uint8_t)(temp1 >> 10U) & 0xFU;

    /* From the second read; TAMPER_DATA[5:0] is the seconds field */
    tamperTimestamp->second = (uint8_t)temp2 & 0x3FU;
    /* From the second read; TAMPER_DATA[11:6] is the minutes field */
    tamperTimestamp->minute = (uint8_t)(temp2 >> 6U) & 0x3FU;
    /* From the second read; TAMPER_DATA[14:12] is the tamper index */
    tamperNum = (uint8_t)(temp2 >> 12U) & 0x7U;

    return tamperNum;
}

#endif /* FSL_FEATURE_RTC_HAS_TAMPER_QUEUE */
#endif /* FSL_FEATURE_RTC_HAS_NO_TAMPER_FEATURE */

/*!
 * brief Select which clock to output from RTC.
 *
 * Select which clock to output from RTC for other modules to use inside SoC, for example,
 * RTC subsystem needs RTC to output 1HZ clock for sub-second counter.
 *
 * param base IRTC peripheral base address
 * param cloOut select clock to use for output
 */
void IRTC_ConfigClockOut(RTC_Type *base, irtc_clockout_sel_t clkOut)
{
    uint16_t ctrlVal = base->CTRL;

    ctrlVal &= (uint16_t)(~RTC_CTRL_CLKOUT_MASK);

    ctrlVal |= RTC_CTRL_CLKOUT((uint16_t)clkOut);

#if !(defined(FSL_FEATURE_RTC_IS_SLAVE) && (FSL_FEATURE_RTC_IS_SLAVE != 0U))
    if (clkOut == kIRTC_ClkoutCoarse1Hz)
    {
        ctrlVal |= RTC_CTRL_COMP_EN_MASK;
    }
    else if (clkOut == kIRTC_ClkoutFine1Hz)
    {
        ctrlVal |= RTC_CTRL_FINEEN_MASK;
    }
    else
    {
        /* empty else */
    }
#endif /* FSL_FEATURE_RTC_IS_SLAVE */

    base->CTRL = ctrlVal;
}

#if defined(FSL_FEATURE_RTC_HAS_CLOCK_SELECT) && FSL_FEATURE_RTC_HAS_CLOCK_SELECT

/*!
 * brief Select which clock is used by RTC.
 *
 * Select which clock is used by RTC to output to the peripheral
 * and divided to generate a 512 Hz clock and a 1 Hz clock.
 *
 * param base IRTC peripheral base address
 * param clkSelect select clock used by RTC
 */
void IRTC_ConfigClockSelect(RTC_Type *base, irtc_clock_select_t clkSelect)
{
    uint16_t ctrlVal = base->CTRL;

    ctrlVal &= (uint16_t)(~RTC_CTRL_CLK_SEL_MASK);

    ctrlVal |= RTC_CTRL_CLK_SEL((uint16_t)clkSelect);

    base->CTRL = ctrlVal;
}

#endif /* FSL_FEATURE_RTC_HAS_CLOCK_SELECT */
